/*******************************************************************************
*
* Common/Inc/common_dvr.h
*
* Description: Driver stuff shared across modules
*
*******************************************************************************/

/*******************************************************************************
*                        Entropic Communications, Inc.
*                         Copyright (c) 2001-2008
*                          All rights reserved.
*******************************************************************************/

/*******************************************************************************
* This file is licensed under GNU General Public license.                      *
*                                                                              *
* This file is free software: you can redistribute and/or modify it under the  *
* terms of the GNU General Public License, Version 2, as published by the Free *
* Software Foundation.                                                         *
*                                                                              *
* This program is distributed in the hope that it will be useful, but AS-IS and*
* WITHOUT ANY WARRANTY; without even the implied warranties of MERCHANTABILITY,*
* FITNESS FOR A PARTICULAR PURPOSE, TITLE, or NONINFRINGEMENT. Redistribution, *
* except as permitted by the GNU General Public License is prohibited.         *

*           G L O B A L   B I T F I E L D   M A N I P U L A T O R S            *
********************************************************************************/

/**
 * Utility to create a mask given a number of bits
 */
#define CLNKDEFS_BITMASK(num_bits)   \
   ((unsigned)(((num_bits) >= 32) ? 0xFFFFFFFF : ((1 << (num_bits)) - 1)))

/**
 * Utility to create a shifted mask given a high and low bit position
 */
#define CLNKDEFS_SHIFTED_BITMASK(bit_high, bit_low) \
   ((unsigned)(CLNKDEFS_BITMASK(1 + (bit_high) - (bit_low)) << (bit_low)))

/**
 * Utility to create a value that alters a particular set of bits
 * within a processor word
 */
#define CLNKDEFS_SUBSTITUTE_FIELD(original, bit_high, bit_low, new_field)                 \
((unsigned)(                                                                              \
    ((original)                  & (~CLNKDEFS_SHIFTED_BITMASK((bit_high), (bit_low)))) |  \
     (((new_field) << (bit_low)) &   CLNKDEFS_SHIFTED_BITMASK((bit_high), (bit_low)))     \
)          )

/**
 * Utility that alters an LVALUE with a substituted field.
 */
#define CLNKDEFS_REPLACE_FIELD(lvalue, bit_high, bit_low, new_field)            \
   do { ((lvalue)) = CLNKDEFS_SUBSTITUTE_FIELD((lvalue), (bit_high),            \
                                             (bit_low), (new_field));           \
   } while (0)

/**
 * Utility to extract a particular field from a word
 */
#define CLNKDEFS_EXTRACT_FIELD(original, bit_high, bit_low) \
     ((unsigned)(((original) & CLNKDEFS_SHIFTED_BITMASK((bit_high), (bit_low))) >> (bit_low)))

// Firmware download constants
#if ECFG_CHIP_ZIP1
#define ISPRAM_START    0xb0040000
#define DSPRAM_START    0x80000000
#define ISPRAM_SIZE     0x20000
#define DSPRAM_SIZE     0x10000
#elif ECFG_CHIP_ZIP2
#define ISPRAM_START    0x0c040000
#define DSPRAM_START    0x0c000000
#define ISPRAM_SIZE     0x20000
#define DSPRAM_SIZE     0x18000
#elif ECFG_CHIP_MAVERICKS
#define ISPRAM_START    0x0c040000
#define DSPRAM_START    0x0c000000
#define ISPRAM_SIZE     0x30000
#define DSPRAM_SIZE     0x20000
#endif

/* for hw_z2_pci and clnkEth */
#define SYS_GET_PARAM(x, p, mask, offset) (((x)->p >> (offset)) & (mask))
#define SYS_SET_PARAM(x, p, mask, offset, val) do \
            { \
                (x)->p = ((x)->p & ~((mask) << (offset))) | \
                         (((val) & (mask)) << (offset)); \
            } while(0)
#define WR_LINEBUF_PDU_SIZE(x, y)   SYS_SET_PARAM((x), packed_0, 0xffff, 0, (y))
#define WR_LINEBUF_ENTRY_SIZE(x, y) SYS_SET_PARAM((x), packed_0, 0xff, 16, (y))
#define WR_LINEBUF_PTR_MODE(x, y)   SYS_SET_PARAM((x), packed_0, 0x1, 24, (y))
/* end for hw_z2_pci and clnkEth */

#define NUM_DEBUG_REG               8
#define NUM_MAILBOX_RD_REG          8
#define NUM_MAILBOX_WR_REG          8
#define NUM_MAILBOX_REG             (NUM_MAILBOX_RD_REG + NUM_MAILBOX_WR_REG)

/// Returns the SoC memory address of element 'x' in dev_shared
#define DEV_SHARED(x) ((SYS_UINT32)(SYS_UINTPTR)(&(((struct shared_data *)DSPRAM_START)->x)))

struct clnk_hw_params
{
    SYS_UINT32              numRxHostDesc;
    SYS_UINT32              numTxHostDesc;
#if ECFG_CHIP_ZIP1
    SYS_UINT32              *minRxLens;
#endif
    void                    *at_lock;
};

typedef struct
{
    SYS_UINT32      zip_major;
    SYS_UINT32      zip_minor;
    SYS_UINT32      datapath;
}
ClnkDef_ZipInfo_t;

//linebuffer descriptor
struct linebuf
{
    SYS_UINT32      packed_0;       /* offset 0x0 */
    SYS_UINT32      n_entries;      /* offset 0x4 */
    SYS_UINT32      buffer_base;    /* offset 0x8 */
    SYS_UINT32      buffer_len;     /* offset 0xc */
    SYS_UINT32      entry_wptr;     /* offset 0x10 */
    SYS_UINT32      entry_rptr;     /* offset 0x14 */
    SYS_UINT32      entry_windex;   /* offset 0x18 */
    SYS_UINT32      entry_rindex;   /* offset 0x1c */
    SYS_UINT32      packed_8;       /* offset 0x20 */
};

#define BRIDGE_ENTRIES      192
#if ECFG_CHIP_MAVERICKS
#define CAM_ENTRIES         160
#else
#define CAM_ENTRIES         128
#endif
#define DATABUF_CAM_ENTRIES 16

typedef struct
{
    SYS_UINT32 macAddrHigh;
    SYS_UINT32 macAddrLow;
}
ClnkDef_BridgeEntry_t; 

/* dumps out a portion of the software CAM (ClnkCam.c) */
typedef struct
{
    SYS_UINT32 num_entries;
    ClnkDef_BridgeEntry_t   ent[BRIDGE_ENTRIES];
}
ClnkDef_BridgeTable_t;

#define NUM_TX_PRIO         3
// clnk_set_eth_fifo_size struct
typedef struct
{
    SYS_UINT32 tx_prio[NUM_TX_PRIO];
}
ClnkDef_TxFifoCfg_t;

#if FEATURE_IQM
// Increase the trace buffer size when DEBUG_DUMP_FFT_VALUES enabled in ccpu code (iqm.h)
#define CLNK_DEF_TRACE_ENTRIES      /*2505*/ 150
#else
#define CLNK_DEF_TRACE_ENTRIES      150
#endif
typedef struct
{
    SYS_UINT32 ctc_time;
    SYS_UINT32 info1;
    SYS_UINT32 info2;
}
ClnkDef_TraceEntry_t;

typedef struct
{
